PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
/***************************************************************************//**
* \file cy_cryptolite_ecc_eddsa.c
* \version 2.80
*
* \brief
*  This file provides constant and parameters for the API for the ECC EDDSA
*  in the Cryptolite driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTOLITE)

#include "cy_sysint.h"
#include "cy_cryptolite_ecdsa.h"
#include "cy_cryptolite_nist_p.h"

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(CY_CRYPTOLITE_CFG_EDDSA_C) || defined(CY_CRYPTOLITE_CFG_EC25519_C)
#include "cy_cryptolite_utils.h"

cy_en_cryptolite_status_t Cy_Cryptolite_EDDSA_Bar_MulRed(CRYPTOLITE_Type *base, cy_stc_cryptolite_context_ecdsa_t *cfContext, uint8_t *p_z, uint32_t out_size, uint8_t *p_x, uint32_t in_size);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_ExpMod(CRYPTOLITE_Type *base, cy_stc_cryptolite_context_ecdsa_t *cfContext, uint8_t *p_x, uint8_t *p_y, uint8_t *p_e, uint32_t bitsize);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519Add(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *s_x, uint8_t *s_y, uint8_t *s_z,
        uint8_t *t_x, uint8_t *t_y, uint32_t size);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519Double(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *s_x, uint8_t *s_y, uint8_t *s_z, uint32_t size);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519InvTransform(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *s_x, uint8_t *s_y, uint8_t *s_z, uint32_t size);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointMul(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *p_x, uint8_t *p_y, uint8_t *p_d, uint32_t bitsize);
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointMulAdd(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *p_x, uint8_t *p_y, uint8_t *s,
        uint8_t *q_x, uint8_t *q_y, uint8_t *h,
        uint32_t bitsize);

#define CY_ED25519SIG_VERIFY_PASS (0xA1A1A1A1u)
#define CY_ED25519SIG_VERIFY_FAIL (0x00BADBADu)


/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_Init
****************************************************************************//**
*
* Init ED25519 Context.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param eccBuffer
* The pointer to the cy_stc_cryptolite_ecc_buffer_t.
*
* \param shaFunctions
* The pointer to the cy_stc_cryptolite_ed25519_sha512_t.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_Init(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ecc_buffer_t *eccBuffer,
        cy_stc_cryptolite_ed25519_sha512_t *shaFunctions)
{
    cy_en_cryptolite_status_t status;

    if ((base == NULL) || (cfContext == NULL) || (eccBuffer == NULL) || (shaFunctions == NULL))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if ((shaFunctions->shactx == NULL) || (shaFunctions->sha_init == NULL) || (shaFunctions->sha_start == NULL) ||
            (shaFunctions->sha_update == NULL) || (shaFunctions->sha_finish == NULL) || (shaFunctions->sha_free == NULL))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    status = Cy_Cryptolite_ECC_Init(base, cfContext, eccBuffer);
    if (status != CY_CRYPTOLITE_SUCCESS)
    {
        return status;
    }

    cfContext->ed25519_sha = shaFunctions;

    return status;
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_Free
****************************************************************************//**
*
* Free ED25519 Context.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_Free(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext)
{
    cy_stc_cryptolite_ed25519_sha512_t *ed25519_sha;
    cy_en_cryptolite_status_t status = Cy_Cryptolite_ECC_Free(base, cfContext);
    if (status != CY_CRYPTOLITE_SUCCESS)
    {
        return status;
    }
    else
    {
        ed25519_sha = cfContext->ed25519_sha;
        status = ed25519_sha->sha_free(ed25519_sha->shactx);
        cfContext->ed25519_sha = NULL;

        return status;
    }

}


/*******************************************************************************
* Function Name: Cy_Cryptolite_EDDSA_Bar_MulRed
****************************************************************************//**
*
* Barrett multiplication modular reduction.
* r = t mod p for known value of p
* r = t - (floor[t * 1/p]*p)
* VR_BARRET = | (1 << 2*bitsize)/ p |
* q = floor([t * VR_BARRETT] >> 2*bitsize)
* r = t - p*q
*
* r = IF (r >= p) r = r - p           - reduce r using mod
* r = IF (r >= p) r = r - p
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param p_z
* Buffer pointer for Barrett reduced value.
*
* \param out_size
* Output buffer size in bits.
*
* \param p_x
* Buffer pointer for non reduced value.
*
* \param in_size
* Input buffer size in bits.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_EDDSA_Bar_MulRed(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *p_z,
        uint32_t out_size,
        uint8_t *p_x,
        uint32_t in_size)
{
    CY_ALIGN(4) uint8_t t_double[VU_BITS_TO_BYTES((CY_CRYPTOLITE_ECC_ED25519_SIZE * 3u) + 7u)] = {0,};
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE + 4u)] = {0,};
    CY_ALIGN(4) uint8_t t1_plus2[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE + 2u)] = {0,};
    CY_ALIGN(4) uint8_t t2_plus2[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE + 2u)] = {0,};

