PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
    uint8_t *z_double = p_x;
    uint8_t *my_z = p_z;
    uint16_t sh = 512u;

    uint8_t *my_P = cfContext->my_P;
    uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;

    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1U];


    /* x*factor */
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, t_double, VU_BITS_TO_WORDS((out_size * 3u) + 7u), (uint8_t *)z_double, VU_BITS_TO_WORDS(in_size), my_BARRETT_U, VU_BITS_TO_WORDS(out_size + 8u));

    /* (x * self.factor) >> self.shift) */
    (void)Cy_Cryptolite_Vu_lsr_hw(base, vu_struct1, t1, VU_BITS_TO_WORDS(out_size + 4u), t_double, VU_BITS_TO_WORDS((out_size * 3u) + 7u), sh);

    /* (x * self.factor) >> self.shift) * mod */
    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, t_double, VU_BITS_TO_WORDS((out_size * 3u) + 7u), t1, VU_BITS_TO_WORDS(out_size + 4u), my_P, VU_BITS_TO_WORDS(out_size));

    /* t = (x - ((x * self.factor) >> self.shift) * mod) */
    (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct1, t2_plus2, VU_BITS_TO_WORDS(out_size + 2u), (uint8_t *)z_double, VU_BITS_TO_WORDS(in_size), t_double, VU_BITS_TO_WORDS((out_size * 3u) + 7u));

    /* check if t < mod, then result = t. else result = t-mod */
    if (Cy_Cryptolite_Vu_test_less_than(base, vu_struct1, t2_plus2, my_P, (uint16_t)out_size))
    {
        Cy_Cryptolite_Setnumber(my_z, t2_plus2, VU_BITS_TO_BYTES(out_size));
    }
    else
    {
        /* t1_plus2 = t - mod */
        (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, t1_plus2, VU_BITS_TO_WORDS(out_size + 2u), t2_plus2, VU_BITS_TO_WORDS(out_size + 2u), my_P, VU_BITS_TO_WORDS(out_size));
        Cy_Cryptolite_Setnumber(my_z, t1_plus2, VU_BITS_TO_BYTES(out_size));
    }

    return CY_CRYPTOLITE_SUCCESS;

}


/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_MulMod
****************************************************************************//**
*
* Modular multiplication in GF(VR_P).
* Leaf function.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param z
* Result = a * b % mod. The pointer to product value.
*
* \param a
* The pointer to multiplicand value.
*
* \param b
* The pointer to multiplier value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_MulMod(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *p_z,
        uint8_t *p_a,
        uint8_t *p_b,
        uint32_t size)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;
    CY_ALIGN(4) uint8_t ab_double[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE * 2u)] = {0,};
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0U];
    uint8_t *my_z = p_z;
    uint8_t *my_a = p_a;
    uint8_t *my_b = p_b;

    (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, ab_double, VU_BITS_TO_WORDS(2U * size), my_a, VU_BITS_TO_WORDS(size), my_b, VU_BITS_TO_WORDS(size));

    /* Barrett reduction result stored in p_z */
    tmpResult = Cy_Cryptolite_EDDSA_Bar_MulRed(base, cfContext, my_z, size, ab_double, (CY_CRYPTOLITE_ECC_ED25519_SIZE * 2u));

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_SquareMod
****************************************************************************//**
*
* Modular squaring in GF(VR_P).
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param z
* Result = a * a % mod. The pointer to product value.
*
* \param a
* The pointer to multiplicand and multiplier value.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_SquareMod(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *p_z,
        uint8_t *p_a,
        uint32_t size)
{
    return Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_z, p_a, p_a, size);
}

#if defined(CY_CRYPTOLITE_CFG_EDDSA_C)
static void Cy_Cryptolite_ED25519_dom2_ctx(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_en_cryptolite_eddsa_sig_type_t sigType,
        const uint8_t *ctx,
        uint32_t ctx_len)
{
    uint8_t ct_init_string[] = "SigEd25519 no Ed25519 collisions";
    uint8_t ct_flag;
    uint8_t ct_ctx_len = (uint8_t)(ctx_len & 0xffu);
    cy_stc_cryptolite_ed25519_sha512_t *ed25519_sha = cfContext->ed25519_sha;

    (void)base;

    ct_flag = (sigType == CY_CRYPTOLITE_EDDSA_CTX) ? (uint8_t)0 : (uint8_t)1;
    /*Note: Can merge to one update call*/
    (void)ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)ct_init_string, 32u);
    (void)ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)&ct_flag, 1u);
    (void)ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)&ct_ctx_len, 1u);

    if (ctx != NULL && ctx_len > 0u)
    {
        (void)ed25519_sha->sha_update(ed25519_sha->shactx, ctx, ctx_len);
    }

}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519Add
****************************************************************************//**
* ED25519 (Edwards and Twisted Edwards) point add on projective coordinates in GF(VR_P).
*
* Add for: R = P + Q
*
* https://hyperelliptic.org/EFD/g1p/auto-code/twisted/projective/addition/add-2008-bbjlp.op3
* with
* P = (X1, Z1)
* Q = (X2, Z2)
* R = (X3, Z3)
* and eliminating temporary variables t0, t3, ..., t9.
*
* Cost: 10M + 1S
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param s_x
* The pointer to projective X coordinate.
*
* \param s_y
* The pointer to projective Y coordinate.
*
* \param s_z
* The pointer to projective Z coordinate.
*
* \param t_x
* The pointer to affine X coordinate.
*
* \param t_y
* The pointer to affine Y coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519Add(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *s_x,
        uint8_t *s_y,
        uint8_t *s_z,
        uint8_t *t_x,
        uint8_t *t_y,
        uint32_t size)
{
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t b[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t c[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t d[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t e[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t f[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t g[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    uint8_t *my_s_x = s_x;
    uint8_t *my_s_y = s_y;
    uint8_t *my_s_z = s_z;
    uint8_t *my_t_x = t_x;
    uint8_t *my_t_y = t_y;
    uint8_t *t2;

