PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;

    /* A = Z1*Z2 */
    /* Z2 = 1 skip first step
    Note: Revisit if we randomize the base points*/
    /* B = A^2 */
    tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, b, my_s_z, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* C = X1*X2 */
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, c, my_s_x, my_t_x, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* D = Y1*Y2 */
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, d, my_s_y, my_t_y, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* E = d*C*D */
    (void)Cy_Cryptolite_Memcpy(base, t1, (uint8_t *)edwDp->d, VU_BITS_TO_BYTES(size));
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, f, c, d, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, e, f, t1, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* F = B-E */
    Cy_Cryptolite_EC_SubMod(base, cfContext, f, b, e);
    /* G = B+E */
    Cy_Cryptolite_EC_AddMod(base, cfContext, g, b, e);
    /* X3 = A*F*((X1+Y1)*(X2+Y2)-C-D) */
    t2 = b;
    Cy_Cryptolite_EC_AddMod(base, cfContext, t1, my_s_x, my_s_y);
    Cy_Cryptolite_EC_AddMod(base, cfContext, t2, my_t_x, my_t_y);

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_x, t1, t2, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Cryptolite_EC_SubMod(base, cfContext, my_s_x, my_s_x, c);
    Cy_Cryptolite_EC_SubMod(base, cfContext, my_s_x, my_s_x, d);

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, t1, my_s_z, f, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_x, my_s_x, t1, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* Y3 = A*G*(D-a*C) */
    (void)Cy_Cryptolite_Memcpy(base, t1, (uint8_t *)edwDp->a, VU_BITS_TO_BYTES(size));
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, t2, my_s_z, g, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, t1, t1, c, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    Cy_Cryptolite_EC_SubMod(base, cfContext, my_s_y, d, t1);
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_y, my_s_y, t2, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* Z3 = F*G */
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_z, f, g, size);

    return tmpResult;

}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519Double
****************************************************************************//**
*
* ED25519 (Edwards and Twisted Edwards) point doubling on projective coordinates in GF(VR_P).
*
* Double for: R = 2 * P for both Edwards and Twisted Edwards curves in projective
* coordinates.
*
* https://hyperelliptic.org/EFD/g1p/auto-code/twisted/projective/doubling/dbl-2008-bbjlp.op3
* with
* P = (X1, Z1)
* R = (X3, Z3)
* and eliminating H and temporary variables t0, ..., t4.
*
* Cost: 3M + 4S
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param s_x
* The pointer to projective X coordinate.
*
* \param s_y
* The pointer to projective Y coordinate.
*
* \param s_z
* The pointer to projective Z coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519Double(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *s_x,
        uint8_t *s_y,
        uint8_t *s_z,
        uint32_t size)
/* 3M + 4S */
{
    CY_ALIGN(4) uint8_t b[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t c[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t d[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t e[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t f[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t j[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    uint8_t *my_s_x = s_x;
    uint8_t *my_s_y = s_y;
    uint8_t *my_s_z = s_z;

    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    (void)Cy_Cryptolite_Memcpy(base, f, (uint8_t *)edwDp->a, VU_BITS_TO_BYTES(size));
    /* B = (X1 + Y1)^2 */
    Cy_Cryptolite_EC_AddMod(base, cfContext, b, my_s_x, my_s_y);
    tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, b, b, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* C = X1^2 */
    tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, c, my_s_x, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* D = Y1^2 */
    tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, d, my_s_y, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* E = eddp->a*C */
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, e, f, c, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* F = E+D */
    Cy_Cryptolite_EC_AddMod(base, cfContext, f, e, d);
    /* J = F - 2*(Z1^2) */
    tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, j, my_s_z, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /*2*(Z1^2) mod p*/
    Cy_Cryptolite_EC_AddMod(base, cfContext, j, j, j);
    Cy_Cryptolite_EC_SubMod(base, cfContext, j, f, j);
    /* X3 = (B-C-D)*J */
    Cy_Cryptolite_EC_SubMod(base, cfContext, b, b, c);
    Cy_Cryptolite_EC_SubMod(base, cfContext, b, b, d);
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_x, b, j, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Y3 = F*(E-D) */
    Cy_Cryptolite_EC_SubMod(base, cfContext, e, e, d);
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_y, f, e, size);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Z3 = F*J */
    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_z, f, j, size);

