PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519InvTransform
****************************************************************************//**
*
* Transformation from projective coordinates to affine coordinates in GF(VR_P).
* (s_x, s_y, s_z) -> (p_x, p_y), where p_x = s_x/s_z, p_y = s_y/s_z
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param s_x
* Pointer to affine X coordinate and projective X coordinate.
*
* \param s_y
* Pointer to affine Y coordinate and projective Y coordinate.
*
* \param s_z
* Pointer to projective Z coordinate.
*
* \param size
* Bit size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519InvTransform(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *s_x,
        uint8_t *s_y,
        uint8_t *s_z,
        uint32_t size)
{
    CY_ALIGN(4) uint8_t t1[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t t2[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
    uint8_t *my_s_x = s_x;
    uint8_t *my_s_y = s_y;
    uint8_t *my_s_z = s_z;

    t1[0] = 1u;

    Cy_Cryptolite_EC_DivMod(base, cfContext, t2, t1, my_s_z, (int)size);   /* t2 = 1/Z */

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_x, my_s_x, t2, size);   /* my_s_x = X/Z */
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, my_s_y, my_s_y, t2, size);   /* t3 = Y/Z */
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    return CY_CRYPTOLITE_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_PointMulAdd
****************************************************************************//**
*
* Edward 25519 Elliptic curve point multiply-Add in GF(p).
*
* R = s*P + h*Q
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param p_x
* Pointer to affine X coordinate of point.
*
* \param p_y
* Pointer to affine Y coordinate of point.
*
* \param s
* Pointer to multiplication value.
*
* \param q_x
* Pointer to affine X coordinate of point.
*
* \param q_y
* Pointer to affine Y coordinate of point.
*
* \param h
* Pointer to for multiplication value.
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointMulAdd(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *p_x, uint8_t *p_y, uint8_t *s,
        uint8_t *q_x, uint8_t *q_y, uint8_t *h,
        uint32_t bitsize)
{
    /* Note: Pre conditions 0 < (px,py)(qx,qy) < N-1 */
    CY_ALIGN(4) uint8_t p_z[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    uint8_t *my_s = s;
    uint8_t *my_P = cfContext->my_P;
    uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    /* load prime defining the curve as well as the barrett coefficient. */
    (void)Cy_Cryptolite_Memcpy(base, my_P, (uint8_t *)edwDp->prime, VU_BITS_TO_BYTES(bitsize));
    (void)Cy_Cryptolite_Memcpy(base, my_BARRETT_U, (uint8_t *)edwDp->barrett_p, VU_BITS_TO_BYTES(edwDp->barret_psize));

    /* init point->z to 1. */
    p_z[0] = 1u;

    /*sB = point_mul(s, G)*/
    tmpResult = Cy_Cryptolite_ED25519_PointMul(base, cfContext, edwDp, p_x, p_y, my_s, bitsize);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /*hA = point_mul(h, A)*/
    tmpResult = Cy_Cryptolite_ED25519_PointMul(base, cfContext, edwDp, q_x, q_y, h, bitsize);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* R = point_add(sB, hA) */
    /* RFC Sec 5.1.7 Check the group equation [S]B = R + [k]A'.  It's sufficient.
       We perform fast single-signature verification by computing R = [s]B + [-k]A'. compressing 'R' and comparing with Sig[R] without
       decompressing it.
    */
    tmpResult = Cy_Cryptolite_ED25519Add(base, cfContext, edwDp, p_x, p_y, p_z, q_x, q_y, bitsize);
    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    /* Inverse transform */
    tmpResult = Cy_Cryptolite_ED25519InvTransform(base, cfContext, p_x, p_y, p_z, bitsize);

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_PointMul
****************************************************************************//**
*
* Edward 25519 Elliptic curve point multiplication in GF(p).
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param p_x
* Pointer to affine X coordinate of base point.
*
* \param p_y
* Pointer to affine Y coordinate of base point.
*
* \param p_d
* Pointer to multiplication value.
*
* \param bitsize
* Bit size of the used curve.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointMul(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        cy_stc_cryptolite_ec25519_dp_type *edwDp,
        uint8_t *p_x,
        uint8_t *p_y,
        uint8_t *p_d,
        uint32_t bitsize)
{
    /* Note: Pre conditions 0 < px, py < p-1 (consider randomizing the base point)*/

    uint32_t i;
    uint32_t carry;
    uint32_t clsame;
    uint32_t loop;

    CY_ALIGN(4) uint8_t my_t_x[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t my_t_y[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t my_s_z[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t my_d[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    uint8_t *my_s_x = p_x;
    uint8_t *my_s_y = p_y;

    uint8_t *my_P = cfContext->my_P;
    uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    /* load prime defining the curve as well as the barrett coefficient. */
    Cy_Cryptolite_Setnumber(my_P, (uint8_t *) edwDp->prime, VU_BITS_TO_BYTES(bitsize));
    Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) edwDp->barrett_p, VU_BITS_TO_BYTES(edwDp->barret_psize));
    cfContext->bitsize = bitsize;

    Cy_Cryptolite_Setnumber(my_t_x, my_s_x, VU_BITS_TO_BYTES(bitsize)); // move my_s_x -> my_t_x
    Cy_Cryptolite_Setnumber(my_t_y, my_s_y, VU_BITS_TO_BYTES(bitsize)); // move my_s_y -> my_t_y
    Cy_Cryptolite_Setnumber(my_d, p_d, VU_BITS_TO_BYTES(bitsize)); // move p_d -> my_d

    /* init point->z to 1. */
    my_s_z[0] = 1u;

    clsame = Cy_Cryptolite_GetCLSAME(my_d, VU_BITS_TO_BYTES(bitsize));

    /* Get rid of leading '0's and '1' */
    Cy_Cryptolite_Vu_lsl(my_d, VU_BITS_TO_WORDS(bitsize), p_d, VU_BITS_TO_WORDS(bitsize), clsame + 1u);

    /* Binary left-to-right algorithm
    * Perform point addition and point doubling to implement scalar multiplication
    * Scan the bits of the scalar from left to right; perform point doubling for each bit,
    * and perform point addition when the bit is set.
    * Carry set if current bit is equal to 1 (hence, perform point addition - point
    * doubling is always performed)
    */
    if (bitsize >= clsame)
    {
        loop = (uint32_t)(bitsize - clsame);
    }
    else
    {
        return CY_CRYPTOLITE_HW_ERROR;
    }

