PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
    for (i = 0; i < (loop); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform point addition - point
        * doubling is always performed)
        */
        carry =  Cy_Cryptolite_Vu_get_bit(my_d, bitsize);
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, my_d, VU_BITS_TO_WORDS(bitsize), my_d, VU_BITS_TO_WORDS(bitsize));


        tmpResult = Cy_Cryptolite_ED25519Double(base, cfContext, edwDp, my_s_x, my_s_y, my_s_z, bitsize);

        if (CY_CRYPTOLITE_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        if (carry != 0u)
        {
            tmpResult = Cy_Cryptolite_ED25519Add(base, cfContext, edwDp, my_s_x, my_s_y, my_s_z, my_t_x, my_t_y, bitsize);

            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
        }

    }

    /* Inverse transform */
    tmpResult = Cy_Cryptolite_ED25519InvTransform(base, cfContext, my_s_x, my_s_y, my_s_z, bitsize);

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_PointMultiplication
****************************************************************************//**
*
* Edwards 25519 elliptic curve point multiplication in GF(p).
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param ecpGX
* X coordinate of base point.
*
* \param ecpGY
* Y coordinate of base point.
*
* \param ecpD
* multiplication scalar value.
*
* \param ecpQX
* X coordinate of result point.
*
* \param ecpQY
* Y coordinate of result point.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointMultiplication(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        const uint8_t *ecpGX,
        const uint8_t *ecpGY,
        const uint8_t *ecpD,
        uint8_t *ecpQX,
        uint8_t *ecpQY)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;
    cy_stc_cryptolite_ec25519_dp_type *edwDp;
    CY_ALIGN(4) uint8_t VR_S_X[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t VR_S_Y[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    CY_ALIGN(4) uint8_t VR_D[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};

    cy_en_cryptolite_ecc_curve_id_t curveID = CY_CRYPTOLITE_ECC_ECP_ED25519;

    edwDp = Cy_Cryptolite_EC25519_GetCurveParams(curveID);
    if (edwDp != NULL)
    {
        uint32_t bitsize;

        bitsize   = edwDp->size;
        tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
        cfContext->bitsize = bitsize;

        if ((NULL != ecpGX) && (NULL != ecpGY) && (NULL != ecpD) && (NULL != ecpQX) && (NULL != ecpQY))
        {
            Cy_Cryptolite_Setnumber(VR_S_X, (uint8_t *)ecpGX, VU_BITS_TO_BYTES(bitsize));
            Cy_Cryptolite_Setnumber(VR_S_Y, (uint8_t *)ecpGY, VU_BITS_TO_BYTES(bitsize));
            Cy_Cryptolite_Setnumber(VR_D, (uint8_t *)ecpD, VU_BITS_TO_BYTES(bitsize));

            /* Public parameters and characteristics of elliptic curve */
            /* ECC calculation: d * G mod p */
            tmpResult = Cy_Cryptolite_ED25519_PointMul(base, cfContext, edwDp, VR_S_X, VR_S_Y, VR_D, bitsize);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            /* Get result P = (X,Y) = d.G from Ed25519 scalar multiplication */
            (void)Cy_Cryptolite_Memcpy(base, ecpQX, VR_S_X, VU_BITS_TO_BYTES(bitsize));
            (void)Cy_Cryptolite_Memcpy(base, ecpQY, VR_S_Y, VU_BITS_TO_BYTES(bitsize));

            tmpResult = CY_CRYPTOLITE_SUCCESS;
        }
    }
    return tmpResult;
}

#endif /* defined(CY_CRYPTOLITE_CFG_EDDSA_C) */

#if defined (CY_CRYPTOLITE_CFG_EDDSA_GENKEY_C)

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_MakePublicKey
****************************************************************************//**
*
* Make a new ED25519 public key
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param privateKey
* [in] Private key.
*
* \param publicKey
* [out] Newly created Public key.
* See \ref cy_stc_cryptolite_ecc_key.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_MakePublicKey(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        const uint8_t *privateKey,
        cy_stc_cryptolite_ecc_key *publicKey)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;
    cy_stc_cryptolite_ec25519_dp_type *eccDp;
    cy_en_cryptolite_ecc_curve_id_t curveID = CY_CRYPTOLITE_ECC_ECP_ED25519;

    if ((base != NULL) && (cfContext != NULL) && (cfContext->ed25519_sha != NULL) && (privateKey != NULL) && (publicKey != NULL) &&
            (publicKey->pubkey.x != NULL) && (publicKey->pubkey.y != NULL))
    {
        eccDp = Cy_Cryptolite_EC25519_GetCurveParams(curveID);
        if (eccDp != NULL)
        {
            uint8_t *p_u1 = cfContext->p_u1;
            uint8_t *p_o = cfContext->p_o;
            uint8_t *p_gx = cfContext->p_gx;
            uint8_t *p_gy = cfContext->p_gy;
            uint8_t *my_P = cfContext->my_P;
            uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
            CY_ALIGN(4) uint8_t p_sha[CY_CRYPTOLITE_SHA512_HASH_SIZE];
            CY_ALIGN(4) uint8_t p_d[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE + 1)];
            cy_stc_cryptolite_ed25519_sha512_t *ed25519_sha = cfContext->ed25519_sha;

            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);

            cfContext->bitsize = bitsize;

            tmpResult = ed25519_sha->sha_init(ed25519_sha->shactx);
            if (CY_CRYPTOLITE_SUCCESS == tmpResult)
            {
                tmpResult = ed25519_sha->sha_start(ed25519_sha->shactx);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
            }
            else
            {
                return tmpResult;
            }

            // Initialize point multiplication
            // load prime, order and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->prime, bytesize);
            Cy_Cryptolite_Setnumber(p_o, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_p, VU_BITS_TO_BYTES(bitsize + 1U));

            // load base Point G
            Cy_Cryptolite_Setnumber(p_gx, (uint8_t *) eccDp->Gx, bytesize);
            Cy_Cryptolite_Setnumber(p_gy, (uint8_t *) eccDp->Gy, bytesize);
            Cy_Cryptolite_Setnumber(p_u1, (uint8_t *)privateKey, bytesize);

