PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
            /*step1: Compute secret scalar 's' and prefix*/
            /*SHA expects big-endian input*/
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)privateKey, bytesize);
            if (CY_CRYPTOLITE_SUCCESS == tmpResult)
            {
                tmpResult = ed25519_sha->sha_finish(ed25519_sha->shactx, p_sha); // output in p_sha
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
            }
            else
            {
                return tmpResult;
            }


            /*Prune the buffer: The lowest three bits of the first octet are cleared, the highest bit of the last octet is cleared,
            and the second highest bit of the last octet is set.*/
            p_sha[0]  &= ~((uint8_t)0x7);
            p_sha[31] &= ~((uint8_t)0x80);
            p_sha[31] |= (uint8_t)0x40;

            Cy_Cryptolite_Setnumber(p_d, (uint8_t *)&p_sha[0], VU_BITS_TO_BYTES(bitsize + 1u));

            /*s = p_sha[0-31] prefix = p_sha[32-63]*/
            tmpResult = Cy_Cryptolite_ED25519_PointMul(base, cfContext, eccDp, p_gx, p_gy, p_d, bitsize);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            Cy_Cryptolite_Setnumber((uint8_t *)publicKey->pubkey.x, (uint8_t *) p_gx, bytesize);
            Cy_Cryptolite_Setnumber((uint8_t *)publicKey->pubkey.y, (uint8_t *) p_gy, bytesize);
            publicKey->type = PK_PUBLIC;
            publicKey->curveID = curveID;

            tmpResult = CY_CRYPTOLITE_SUCCESS;
        }

    }
    return (tmpResult);
}

#endif /* defined (CY_CRYPTOLITE_CFG_EDDSA_GENKEY_C) */

#if defined(CY_CRYPTOLITE_CFG_EDDSA_SIGN_C)

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_Sign
****************************************************************************//**
*
* Sign a message.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param hash
* The message to sign. Provided as is in data buffer. This is usually the hash of
* the original data to be signed.
*
* \param hashlen
* The length of the message in bytes.
*
* \param sig
* [out] The destination for the signature, 'r' followed by 's'.
*
* \param key
* Key (Little Endian) used for signature generation. See \ref cy_stc_cryptolite_ecc_key.
*
* \param sigType
* signature Type. CY_CRYPTOLITE_EDDSA_PURE,CY_CRYPTOLITE_EDDSA_CTX or CY_CRYPTOLITE_EDDSA_PREHASH
*
* \param sigctx
* signature context. can be NULL if EDDSA_PURE is used or if no context is provided.
*
* \param sigctx_len
* The length of the signature context
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Ed25519_sign_verify
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_Sign(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        const uint8_t *hash,
        uint32_t hashlen,
        uint8_t *sig,
        const cy_stc_cryptolite_ecc_key *key,
        cy_en_cryptolite_eddsa_sig_type_t sigType,
        const uint8_t *sigctx,
        uint32_t sigctx_len)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
    cy_stc_cryptolite_ec25519_dp_type *eccDp;

    /* input param validation */
    if (hash == NULL && 0u != hashlen)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }
    /*
    Value of context is set by the signer and verifier (maximum of 255
    octets; the default is empty string, except for Ed25519, which can't
    have context) and has to match octet by octet for verification to be
    successful.
    */
    if (sigType != CY_CRYPTOLITE_EDDSA_PURE)
    {
        if (sigType == CY_CRYPTOLITE_EDDSA_CTX)
        {
            if (sigctx == NULL  || sigctx_len == 0u || sigctx_len > 255u)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
        }
        else
        {
            if (sigType == CY_CRYPTOLITE_EDDSA_PREHASH && hashlen != CY_CRYPTOLITE_SHA512_HASH_SIZE)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
        }
    }

    if ((cfContext->ed25519_sha != NULL) && (sig != NULL) && (key != NULL) && (sigType < CY_CRYPTOLITE_EDDSA_NONE))
    {
        tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;
        eccDp = Cy_Cryptolite_EC25519_GetCurveParams(key->curveID);
        if (eccDp != NULL)
        {
            CY_ALIGN(4) uint8_t p_sha[CY_CRYPTOLITE_SHA512_HASH_SIZE] = {0,};

            CY_ALIGN(4) uint8_t p_temp[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] = {0,};
            CY_ALIGN(4) uint8_t p_x[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] = {0,};
            CY_ALIGN(4) uint8_t p_y[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] = {0,};

            //uint8_t *p_temp = cfContext->p_buf;
            uint8_t *p_r = cfContext->p_r;
            uint8_t *p_s = cfContext->p_s;
            uint8_t *p_gx = cfContext->p_gx;
            uint8_t *p_gy = cfContext->p_gy;
            uint8_t *my_P = cfContext->my_P;
            uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;

            uint8_t *digest;
            uint8_t *scalar;
            uint8_t *prefix;
            uint8_t *pubkey_x;
            uint8_t *pubkey_y;
            uint8_t *r_x;
            uint8_t *r_y;
            cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
            cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];
            cy_stc_cryptolite_ed25519_sha512_t *ed25519_sha = cfContext->ed25519_sha;
            uint32_t bitsize  = eccDp->size;
            uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);

            // load prime, order and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_o, VU_BITS_TO_BYTES(eccDp->barret_osize));
            cfContext->bitsize = bitsize;

            // load base Point G
            Cy_Cryptolite_Setnumber(p_gx, (uint8_t *) eccDp->Gx, bytesize);
            Cy_Cryptolite_Setnumber(p_gy, (uint8_t *) eccDp->Gy, bytesize);
            Cy_Cryptolite_Setnumber(p_x, (uint8_t *) eccDp->Gx, bytesize);
            Cy_Cryptolite_Setnumber(p_y, (uint8_t *) eccDp->Gy, bytesize);

            Cy_Cryptolite_Vu_memset(p_r, 0, bytesize);

            digest = p_sha; // digest points to sha memory location

            //sha init
            tmpResult = ed25519_sha->sha_init(ed25519_sha->shactx);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            //sha start
            tmpResult = ed25519_sha->sha_start(ed25519_sha->shactx);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

