PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
            /*step1: Compute secret scalar 's' and prefix*/
            /*SHA expects big-endian*/
            //sha update
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)key->k, bytesize);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_finish(ed25519_sha->shactx, digest);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /*Prune the buffer: The lowest three bits of the first octet are cleared, the highest bit of the last octet is cleared,
            and the second highest bit of the last octet is set.*/
            digest[0]  &= ~((uint8_t)0x7);
            digest[31] &= ~((uint8_t)0x80);
            digest[31] |= (uint8_t)0x40;

            /*s = digest[0-31] prefix = digest[32-63]*/
            scalar = &digest[0];
            prefix = &digest[32];

            /* store scalar value in p_s */
            Cy_Cryptolite_Setnumber(p_s, (uint8_t *)scalar, (CY_CRYPTOLITE_SHA512_HASH_SIZE >> 1u));

            /* generate pubKey A = [s]B */
            tmpResult =  Cy_Cryptolite_ED25519_PointMul(base, cfContext, eccDp, p_gx, p_gy, p_s, bitsize);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            //update pubkey_x and pubkey_y
            pubkey_x = p_gx;
            pubkey_y = p_gy;

            /* step2: 'r' computation */
            tmpResult = ed25519_sha->sha_init(ed25519_sha->shactx);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            //sha start
            tmpResult = ed25519_sha->sha_start(ed25519_sha->shactx);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }

            /* EDDSA sig mode as per 5.1 RFC 8032 */
            if (sigType != CY_CRYPTOLITE_EDDSA_PURE)
            {
                Cy_Cryptolite_ED25519_dom2_ctx(base, cfContext, sigType, sigctx, sigctx_len);
            }
            /*update prefix and input hash */
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)prefix, (CY_CRYPTOLITE_SHA512_HASH_SIZE >> 1u));
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)hash, hashlen);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_finish(ed25519_sha->shactx, digest);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }

            /* reload prime, order and barrett coefficient incase it is overridden */
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_o, VU_BITS_TO_BYTES(eccDp->barret_osize));

            /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
            if (CY_CRYPTOLITE_SUCCESS != Cy_Cryptolite_EDDSA_Bar_MulRed(base, cfContext, p_r, bitsize, p_sha, (CY_CRYPTOLITE_SHA512_HASH_SIZE * 8u)))
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }

            /* Step 3 */
            tmpResult = Cy_Cryptolite_ED25519_PointMul(base, cfContext, eccDp, p_x, p_y, p_r, bitsize);
            if (CY_CRYPTOLITE_SUCCESS != tmpResult)
            {
                return tmpResult;
            }

            /*Note: key encode/decode can be a separate function helps verify */
            /* encode point: From RFC 5.1.2, we shall copy LSB of x to the MSB of y */
            /* Test p_x for odd */
            r_x = p_x;
            r_y = p_y;
            if ((bool)(((uint8_t *)r_x)[0] & (uint8_t)0x01))
            {
                ((uint8_t*)r_y)[31] = ((uint8_t*)r_y)[31] | (uint8_t)0x80;
            }
            /* Copy r to sig result */
            Cy_Cryptolite_Setnumber((uint8_t *)&sig[0], (uint8_t *) p_y, bytesize);


            /* Step4: 's' computation */
            tmpResult = ed25519_sha->sha_init(ed25519_sha->shactx);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_start(ed25519_sha->shactx);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            /* EDDSA sig mode as per 5.1 RFC 8032 */
            if (sigType != CY_CRYPTOLITE_EDDSA_PURE)
            {
                Cy_Cryptolite_ED25519_dom2_ctx(base, cfContext, sigType, sigctx, sigctx_len);
            }
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)r_y, bytesize);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            /*Note: key encode/decode can be a separate function */
            /* encode point: From RFC 5.1.2, we shall copy LSB of x to the MSB of y */
            if ((bool)(((uint8_t *)pubkey_x)[0] & (uint8_t)0x01))
            {
                ((uint8_t*)pubkey_y)[31] = ((uint8_t*)pubkey_y)[31] | (uint8_t)0x80;
            }
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)pubkey_y, bytesize);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)hash, hashlen);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }
            tmpResult = ed25519_sha->sha_finish(ed25519_sha->shactx, digest);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }


            /* reload prime, order and barrett coefficient incase it is overridden */
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) eccDp->order, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) eccDp->barrett_o, VU_BITS_TO_BYTES(eccDp->barret_osize));
            /* step5 */
            /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
            if (CY_CRYPTOLITE_SUCCESS != Cy_Cryptolite_EDDSA_Bar_MulRed(base, cfContext, p_temp, bitsize, p_sha, (CY_CRYPTOLITE_SHA512_HASH_SIZE * 8u)))
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }

