PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
            (void)Cy_Cryptolite_Vu_mul_hw(base, vu_struct0, p_sha, VU_BYTES_TO_WORDS(CY_CRYPTOLITE_SHA512_HASH_SIZE), p_temp, VU_BITS_TO_WORDS(bitsize), p_s, VU_BITS_TO_WORDS(bitsize));
            (void)Cy_Cryptolite_Vu_add_hw(base, vu_struct1, p_sha, VU_BYTES_TO_WORDS(CY_CRYPTOLITE_SHA512_HASH_SIZE), p_sha, VU_BYTES_TO_WORDS(CY_CRYPTOLITE_SHA512_HASH_SIZE), p_r, VU_BITS_TO_WORDS(bitsize));

            /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
            if (CY_CRYPTOLITE_SUCCESS != Cy_Cryptolite_EDDSA_Bar_MulRed(base, cfContext, p_s, bitsize, p_sha, (CY_CRYPTOLITE_SHA512_HASH_SIZE * 8u)))
            {
                return CY_CRYPTOLITE_HW_ERROR;
            }

            /* copy s to sig buffer*/
            if ((Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_s, (uint16_t)bitsize) != true))
            {
                /* S is not zero!!! */
                Cy_Cryptolite_Setnumber((uint8_t *)&sig[bytesize], (uint8_t *) p_s, bytesize);
            }
            else
            {
                tmpResult = CY_CRYPTOLITE_HW_ERROR;
            }

        }
    }
    return (tmpResult);
}

#endif /* defined(CY_CRYPTOLITE_CFG_EDDSA_SIGN_C) */

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_ExpMod
****************************************************************************//**
*
* Modular exponentiation x = y^e mod p.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param p_x
* Pointer to result X .
*
* \param p_y
* Input integer Y.
*
* \param p_e
* Exponent.
*
* \param bitsize
* Bit size of the input Y.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_ExpMod(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *p_x, uint8_t *p_y, uint8_t *p_e, uint32_t bitsize)
{
    uint32_t clsame;
    uint32_t carry;
    uint32_t i;
    uint32_t loop;
    uint8_t my_p_e[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
    uint32_t bytesize = VU_BITS_TO_BYTES(bitsize);
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];

    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;

    if (p_y == NULL || p_e == NULL || bitsize == 0u)
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    /* normalize expression */
    //move the content from s_y to s_x
    Cy_Cryptolite_Setnumber((uint8_t *)p_x, (uint8_t *) p_y, bytesize);
    Cy_Cryptolite_Setnumber((uint8_t *)my_p_e, (uint8_t *) p_e, bytesize);

    clsame = Cy_Cryptolite_GetCLSAME(my_p_e, bytesize);

    /* Get rid of leading '0's and '1' */
    Cy_Cryptolite_Vu_lsl(my_p_e, VU_BITS_TO_WORDS(bitsize), p_e, VU_BITS_TO_WORDS(bitsize), clsame + 1u);

    /* Binary left-to-right algorithm
    * Perform mul and squaring to implement exponential mod multiplication
    * Scan the bits of the exponent from left to right; perform squaring for each bit,
    * and perform mul when the bit is set. Carry set if current bit is equal to 1
    * (hence perform mul, squaring is always performed)
    */
    if (bitsize >= clsame)
    {
        loop = (uint32_t)(bitsize - clsame);
    }
    else
    {
        return CY_CRYPTOLITE_HW_ERROR;
    }

    for (i = 0; i < (loop); i++)
    {
        /* Carry set if current bit is equal to 1 (hence, perform multiply,
        * squaring is always performed)
        */
        // check is 1 was there in msb
        carry = Cy_Cryptolite_Vu_get_bit(my_p_e, bitsize);
        (void)Cy_Cryptolite_Vu_lsl1_hw(base, vu_struct0, my_p_e, VU_BITS_TO_WORDS(bitsize), my_p_e, VU_BITS_TO_WORDS(bitsize));

        tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, p_x, p_x, bitsize);

        if (CY_CRYPTOLITE_SUCCESS != tmpResult)
        {
            return tmpResult;
        }

        // if carry was set then do multiply
        if (carry != 0u)
        {
            (void)Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_x, p_x, p_y, bitsize);
        }
    }

    return tmpResult;
}

#if defined(CY_CRYPTOLITE_CFG_EDDSA_VERIFY_C)
/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_PointDecode
****************************************************************************//**
*
* Decode ED25519 encoded public key in to x and y
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param publicKey
* [in] encoded 32 byte Public key.
*
* \param pubKey_x
* [out] Decoded 32 bytes Public key x in little-endian format.
*
* \param pubKey_y
* [out] Decoded 32 bytes Public key y in little-endian format.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_PointDecode(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        const uint8_t *publicKey,
        uint8_t *pubKey_x, uint8_t *pubKey_y)
{
    cy_stc_cryptolite_ec25519_dp_type *edwDp;

    uint8_t x_0;

    uint8_t p_buff[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] = {0,};
    uint8_t *p_a = cfContext->p_r;
    uint8_t *p_d = cfContext->p_s;
    uint8_t *p_uv = cfContext->p_o;
    uint8_t *p_x = p_buff;
    uint8_t *p_y = cfContext->p_u2;
    uint8_t *my_P = cfContext->my_P;
    uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;
    cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
    cy_stc_cryptolite_descr_t *vu_struct1 = &cfContext->vu_desptr[1];

    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_SUCCESS;
    cy_en_cryptolite_ecc_curve_id_t curveId = CY_CRYPTOLITE_ECC_ECP_ED25519;

    /* (p-5)/8 */
    CY_ALIGN(4) static const uint8_t  ed25519_pb8_exp[CY_CRYPTOLITE_ECC_ED25519_BYTE_SIZE] =
    {
        0xfd, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
        0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
        0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0x0f
    };
    /* 2^((p-1)/4) */
    CY_ALIGN(4)static const uint8_t ed25519_sqrt_m1[] =
    {
        0xB0, 0xA0, 0x0E, 0x4A, 0x27, 0x1B, 0xEE, 0xC4, 0x78, 0xE4, 0x2F, 0xAD,
        0x06, 0x18, 0x43, 0x2F, 0xA7, 0xD7, 0xFB, 0x3D, 0x99, 0x00, 0x4D, 0x2B,
        0x0B, 0xDF, 0xC1, 0x4F, 0x80, 0x24, 0x83, 0x2B
    };

