PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
    edwDp = Cy_Cryptolite_EC25519_GetCurveParams(curveId);
    if (edwDp != NULL)
    {
        if ((publicKey != NULL) && (pubKey_x != NULL) && (pubKey_y != NULL))
        {
            uint32_t bitsize  = edwDp->size;
            uint32_t bytesize = CY_CRYPTOLITE_BYTE_SIZE_OF_BITS(edwDp->size);

            Cy_Cryptolite_Setnumber((uint8_t *)p_a, (uint8_t *)edwDp->a, bytesize);
            Cy_Cryptolite_Setnumber((uint8_t *)p_d, (uint8_t *)edwDp->d, bytesize);
            // load prime and barrett coefficient
            Cy_Cryptolite_Setnumber(my_P, (uint8_t *) edwDp->prime, bytesize);
            Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *) edwDp->barrett_p, VU_BITS_TO_BYTES(edwDp->barret_psize));
            cfContext->bitsize = bitsize;

            /* Recover x_0 and generate p_y*/
            Cy_Cryptolite_Vu_memcpy((void*)pubKey_y, (void const *)publicKey, bytesize);

            x_0 = pubKey_y[31] >> (uint8_t)0x07;
            pubKey_y[31] &= (uint8_t)0x7F;

            /* If the resulting y >= grp->P, decoding fails. */
            Cy_Cryptolite_Vu_memcpy((void*)p_y, (void const *)pubKey_y, bytesize);

            if (!Cy_Cryptolite_Vu_test_less_than(base, vu_struct0, p_y, my_P, (uint16_t)bitsize))
            {
                /* p_y is not less than P!!! */
                tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
            }

            /*
            To recover the x-coordinates, the curve equation implies x^2 = (y^2 - 1) / (d y^2 - a) (mod p).
            The denominator is always non-zero mod p. Let u = y^2 - 1 and v = d y^2 - a.
            We compute the square root of (u/v) depending on p (mod 8),for ED25519 its 5. The candidate root is
            x = sqrt(u/v) = u (u v)^((p-5)/8)
            */
            if (CY_CRYPTOLITE_SUCCESS == tmpResult)
            {
                /*y^2*/
                tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, p_y, p_y, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* dy^2*/
                tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_d, p_d, p_y, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* v = (dy^2 - a) */
                Cy_Cryptolite_EC_SubMod(base, cfContext, p_d, p_d, p_a);
                /* u = y^2 - 1 */
                p_x[0] = 1u;

                (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0, p_y, VU_BITS_TO_WORDS(bitsize), p_y, VU_BITS_TO_WORDS(bitsize), p_x, VU_BITS_TO_WORDS(bitsize));
                /* compute u*((uv)^((p-5)/8)) mod p */
                Cy_Cryptolite_Setnumber(p_x, (uint8_t *)ed25519_pb8_exp, VU_BITS_TO_BYTES(bitsize));
                tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_a, p_d, p_y, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                tmpResult = Cy_Cryptolite_ED25519_ExpMod(base, cfContext, p_uv, p_a, p_x, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_uv, p_uv, p_y, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                /* If v * x^2 = u (mod p), x is a square root. */
                tmpResult = Cy_Cryptolite_ED25519_SquareMod(base, cfContext, p_x, p_uv, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }
                tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_x, p_x, p_d, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                if (Cy_Cryptolite_Vu_test_equal(base, vu_struct0, p_x, p_y, (uint16_t)bitsize) != true)
                {
                    /* Otherwise if v x^2 = -u (mod p), x * 2^((p-1)/4) is a square
                    * root. */
                    Cy_Cryptolite_EC_SubMod(base, cfContext, p_x, my_P, p_x);
                    if (Cy_Cryptolite_Vu_test_equal(base, vu_struct1, p_x, p_y, (uint16_t)bitsize) != true)
                    {
                        return CY_CRYPTOLITE_BAD_PARAMS;
                    }
                    /* x *= 2^((p-1)/4) */
                    Cy_Cryptolite_Setnumber(p_y, (uint8_t *)ed25519_sqrt_m1, VU_BITS_TO_BYTES(bitsize));
                    tmpResult = Cy_Cryptolite_ED25519_MulMod(base, cfContext, p_x, p_uv, p_y, bitsize);
                    if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                    {
                        return tmpResult;
                    }
                }
                else
                {
                    p_x = p_uv;
                }

                /* Use the x_0 bit to select the right square root. */
                if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_x, (uint16_t)bitsize) && (x_0 == 1u))
                {
                    return CY_CRYPTOLITE_BAD_PARAMS;
                }
                else
                {
                    if ((p_x[0] & 0x1u) != x_0)
                    {
                        Cy_Cryptolite_EC_SubMod(base, cfContext, p_x, my_P, p_x);
                    }
                }

                Cy_Cryptolite_Setnumber(pubKey_x, p_x, VU_BITS_TO_BYTES(bitsize));
            }

        }
    }
    return (tmpResult);
}

/*******************************************************************************
* Function Name: Cy_Cryptolite_ED25519_Verify
****************************************************************************//**
*
* Verify ED25519 signed message. On successful verification, CY_CRYPTOLITE_SUCCESS is returned and stat is 0xA1A1A1A1.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param cfContext
* The pointer to the cy_stc_cryptolite_context_ecdsa_t.
*
* \param sig
* The signature to verify, 'R' followed by 'S'.
*
* \param hash
* The hash or message that was signed.
*
* \param hashlen
* The length of the hash or message (octets).
*
* \param stat
* Result of signature verification, 0xA1A1A1A1==valid, 0x00BADBAD==invalid.
*
* \param key
* The corresponding uncompressed public key to use (little-endian). See \ref cy_stc_cryptolite_ecc_key.
*
* \param sigType
* signature Type. CY_CRYPTOLITE_EDDSA_PURE,CY_CRYPTOLITE_EDDSA_CTX or CY_CRYPTOLITE_EDDSA_PREHASH
*
* \param sigctx
* signature context. can be NULL if EDDSA_PURE is used or if no context is provided.
*
* \param sigctx_len
* The length of the signature context
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Ed25519_sign_verify
*
*******************************************************************************/
cy_en_cryptolite_status_t Cy_Cryptolite_ED25519_Verify(CRYPTOLITE_Type *base,
        cy_stc_cryptolite_context_ecdsa_t *cfContext,
        uint8_t *sig,
        const uint8_t *hash, uint32_t hashlen,
        const cy_stc_cryptolite_ecc_key *key,
        uint32_t *stat,
        cy_en_cryptolite_eddsa_sig_type_t sigType,
        const uint8_t *sigctx, uint32_t sigctx_len)
{
    cy_en_cryptolite_status_t tmpResult = CY_CRYPTOLITE_BAD_PARAMS;
    cy_stc_cryptolite_ec25519_dp_type *eccDp;
    cy_stc_cryptolite_ed25519_sha512_t *ed25519_sha;

    /* input parameters validation */
    if ((hash == NULL) && (0u != hashlen))
    {
        return CY_CRYPTOLITE_BAD_PARAMS;
    }

    if ((sig != NULL) && (stat != NULL) && (key != NULL) && (cfContext != NULL) && (sigType < CY_CRYPTOLITE_EDDSA_NONE))
    {
        /*
        Value of context is set by the signer and verifier (maximum of 255
        octets; the default is empty string, except for Ed25519, which can't
        have context) and has to match octet by octet for verification to be
        successful.
        */
        if (sigType == CY_CRYPTOLITE_EDDSA_CTX)
        {
            if (sigctx == NULL  || sigctx_len == 0u || sigctx_len > 255u)
            {
                return CY_CRYPTOLITE_BAD_PARAMS;
            }
        }

        if (cfContext->ed25519_sha == NULL)
        {
            return CY_CRYPTOLITE_BAD_PARAMS;
        }

        tmpResult = CY_CRYPTOLITE_NOT_SUPPORTED;
        *stat = CY_ED25519SIG_VERIFY_FAIL;
        ed25519_sha = cfContext->ed25519_sha;

        eccDp = Cy_Cryptolite_EC25519_GetCurveParams(key->curveID);
        if (eccDp != NULL)
        {
            //sha init
            tmpResult = ed25519_sha->sha_init(ed25519_sha->shactx);
            if (tmpResult != CY_CRYPTOLITE_SUCCESS)
            {
                return tmpResult;
            }

            tmpResult = ed25519_sha->sha_start(ed25519_sha->shactx);

            if (CY_CRYPTOLITE_SUCCESS == tmpResult)
            {
                CY_ALIGN(4) uint8_t p_temp[VU_BITS_TO_BYTES(CY_CRYPTOLITE_ECC_ED25519_SIZE)] = {0,};
                CY_ALIGN(4) uint8_t p_sha[CY_CRYPTOLITE_SHA512_HASH_SIZE] = {0,};
                cy_stc_cryptolite_descr_t *vu_struct0 = &cfContext->vu_desptr[0];
                uint8_t *p_r = cfContext->p_r;
                uint8_t *p_s = cfContext->p_s;



                uint8_t *S_X = cfContext->p_gx;
                uint8_t *S_Y = cfContext->p_gy;
                uint8_t *pubkey_x = cfContext->p_qx;
                uint8_t *pubkey_y = cfContext->p_qy;
                uint8_t *my_P = cfContext->my_P;
                uint8_t *my_BARRETT_U = cfContext->my_BARRETT_U;

                uint32_t bitsize  = eccDp->size;
                uint32_t bytesize = VU_BITS_TO_BYTES(eccDp->size);

