PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_cryptolite_ecc_eddsa.c
                cfContext->bitsize = bitsize;
                /* load values needed for reduction modulo order of the base point */
                Cy_Cryptolite_Setnumber(my_P, (uint8_t *)eccDp->order, VU_BITS_TO_BYTES(bitsize));
                Cy_Cryptolite_Setnumber(my_BARRETT_U, (uint8_t *)eccDp->barrett_o, VU_BITS_TO_BYTES(eccDp->barret_osize));

                /* check that R and S are within the valid range, i.e. 0 < R < n and 0 < S < n */
                Cy_Cryptolite_Setnumber(p_r, (uint8_t *)sig, bytesize);
                Cy_Cryptolite_Setnumber(p_s, (uint8_t *)&sig[VU_BITS_TO_BYTES(bitsize)], bytesize);

                if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_r, (uint16_t)bitsize) == true)
                {
                    return CY_CRYPTOLITE_BAD_PARAMS;
                }

                if (Cy_Cryptolite_Vu_test_zero(base, vu_struct0, p_s, (uint16_t)bitsize) == true)
                {
                    return CY_CRYPTOLITE_BAD_PARAMS;
                }

                // load base Point G
                Cy_Cryptolite_Setnumber(S_X, (uint8_t *) eccDp->Gx, bytesize);
                Cy_Cryptolite_Setnumber(S_Y, (uint8_t *) eccDp->Gy, bytesize);

                // load public key Qa
                Cy_Cryptolite_Setnumber(pubkey_x, (uint8_t *)key->pubkey.x, bytesize);
                Cy_Cryptolite_Setnumber(pubkey_y, (uint8_t *)key->pubkey.y, bytesize);

                /* step1 */
                /*SHA expects big-endian*/
                if (sigType != CY_CRYPTOLITE_EDDSA_PURE)
                {
                    Cy_Cryptolite_ED25519_dom2_ctx(base, cfContext, sigType, sigctx, sigctx_len);
                }

                /* step2: h = sha512(Rs + public + msg) mod N */
                tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)p_r, bytesize);
                if (tmpResult != CY_CRYPTOLITE_SUCCESS)
                {
                    return tmpResult;
                }
                /* compress public key */
                if ((bool)(((uint8_t *)pubkey_x)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)pubkey_y)[31] |= (uint8_t)0x80;
                }
                tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)pubkey_y, bytesize);
                if (tmpResult != CY_CRYPTOLITE_SUCCESS)
                {
                    return tmpResult;
                }
                /* For EDDSA_PREHASH, buf should contain the SHA512 hash. It contains the whole message otherwise */
                tmpResult = ed25519_sha->sha_update(ed25519_sha->shactx, (uint8_t const*)hash, hashlen);
                if (tmpResult != CY_CRYPTOLITE_SUCCESS)
                {
                    return tmpResult;
                }
                tmpResult = ed25519_sha->sha_finish(ed25519_sha->shactx, p_sha);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* Mod reduction modulo n (order of the base point in VR_P and barret_o in VR_BARRET) */
                if (CY_CRYPTOLITE_SUCCESS != Cy_Cryptolite_EDDSA_Bar_MulRed(base, cfContext, p_temp, bitsize, p_sha, (CY_CRYPTOLITE_SHA512_HASH_SIZE * 8u)))
                {
                    return CY_CRYPTOLITE_BAD_PARAMS;
                }

                /* Step 3 */
                /* We perform fast single-signature verification by compressing sB-hA and comparing with r without decompressing it */
                ((uint8_t*)pubkey_y)[31] &= (uint8_t)0x7F;

                (void)Cy_Cryptolite_Vu_sub_hw(base, vu_struct0,
                                              p_temp, VU_BITS_TO_WORDS(bitsize + 1u),
                                              my_P, VU_BITS_TO_WORDS(bitsize),
                                              p_temp, VU_BITS_TO_WORDS(bitsize + 1u));

                /* R = sG + hA */
                tmpResult =  Cy_Cryptolite_ED25519_PointMulAdd(base, cfContext, eccDp, S_X, S_Y, p_s, pubkey_x, pubkey_y, p_temp, bitsize);
                if (CY_CRYPTOLITE_SUCCESS != tmpResult)
                {
                    return tmpResult;
                }

                /* Compress R (we re-use pubkey_x & y)*/
                if ((bool)(((uint8_t *)S_X)[0] & (uint8_t)0x01))
                {
                    ((uint8_t*)S_Y)[31] |= (uint8_t)0x80;
                }

                /* since its compressed we are free to compare with r without decompressing it */
                if (Cy_Cryptolite_Vu_test_equal(base, vu_struct0, S_Y, p_r, (uint16_t)bitsize))
                {
                    *stat = CY_ED25519SIG_VERIFY_PASS;
                }
                else
                {
                    *stat = CY_ED25519SIG_VERIFY_FAIL;
                }
            }
        }
    }

    return (tmpResult);
}

#endif /* defined(CY_CRYPTOLITE_CFG_EDDSA_VERIFY_C) */
#endif /* defined(CY_CRYPTOLITE_CFG_EDDSA_C) || defined(CY_CRYPTOLITE_CFG_EC25519_C) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTOLITE */
